Revit 2024 API
DocumentEntryPoint.LoadFamilySymbol Method
Loads only a specified family type/symbol from a family file into the document.
Overload List
Name | Description
LoadFamilySymbol(String, String)
Loads only a specified family type/symbol from a family file into the document.
 (Inherited from Document.)
LoadFamilySymbol(String, String, FamilySymbol)
Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol.
 (Inherited from Document.)
LoadFamilySymbol(String, String, IFamilyLoadOptions, FamilySymbol)
Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol.
 (Inherited from Document.)
See Also
DocumentEntryPoint Class
DocumentEntryPoint Members
Autodesk.Revit.DB.Macros Namespace